3142430257/chendian/STM32G431CBT6_Motor/STM32G431CBT6_motor/App/app_control.c
void app_control_update(void)
{
    FocMeasurement_t meas;
    foc_interface_get_measurement(&meas);

    switch (s_state)
    {
    /* ---- 零偏校准 ---- */
    case STATE_CALIBRATE:
    {
        uint32_t current_frame = foc_interface_get_frame_count();
        if (current_frame != last_frame_cnt) {
            last_frame_cnt = current_frame;

            /* 驱动板未使能，累加真实 ADC 原始值求均值作为零偏 */
            uint16_t raw_now[FOC_ADC_CH_COUNT];
            foc_interface_get_adc_raw(raw_now);
            s_calib_sum_iu += raw_now[FOC_ADC_IDX_IU];
            s_calib_sum_iv += raw_now[FOC_ADC_IDX_IV];
            s_calib_sum_iw += raw_now[FOC_ADC_IDX_IW];
            s_calib_cnt++;

            if (s_calib_cnt >= CALIB_SAMPLES)
            {
                uint16_t raw_u = (uint16_t)((s_calib_sum_iu + CALIB_SAMPLES / 2U) / CALIB_SAMPLES);
                uint16_t raw_v = (uint16_t)((s_calib_sum_iv + CALIB_SAMPLES / 2U) / CALIB_SAMPLES);
                uint16_t raw_w = (uint16_t)((s_calib_sum_iw + CALIB_SAMPLES / 2U) / CALIB_SAMPLES);

                /* 合理性检查：理论零电流 ADC ≈ 1.25V/3.3V×4095 = 1551。
                 * 允许 ±300 容差（1251~1851），超出范围则用理论值兜底。
                 * 防止校准期间意外通电导致 offset 严重偏差。 */
                #define OFFSET_THEORETICAL  (1551U)
                #define OFFSET_TOLERANCE    (300U)
                if (raw_u < OFFSET_THEORETICAL - OFFSET_TOLERANCE ||
                    raw_u > OFFSET_THEORETICAL + OFFSET_TOLERANCE) {
                    raw_u = OFFSET_THEORETICAL;
                }
                if (raw_v < OFFSET_THEORETICAL - OFFSET_TOLERANCE ||
                    raw_v > OFFSET_THEORETICAL + OFFSET_TOLERANCE) {
                    raw_v = OFFSET_THEORETICAL;
                }
                if (raw_w < OFFSET_THEORETICAL - OFFSET_TOLERANCE ||
                    raw_w > OFFSET_THEORETICAL + OFFSET_TOLERANCE) {
                    raw_w = OFFSET_THEORETICAL;
                }
                iu_offset_raw = raw_u;
                iv_offset_raw = raw_v;
                iw_offset_raw = raw_w;
                ctrl_sd_set(false);  /* 校准完成，保持驱动禁用直到用户使能 */
                s_state = STATE_READY;
            }
        }
        break;
    }

    /* ---- 编码器对齐（串口 'a' 命令触发）---- */
    case STATE_ALIGN:
        align_update(&meas);
        break;

    /* ---- 就绪 + 对齐方向验证 ---- */
    case STATE_READY:
        if (s_align_need_verify) {
            s_align_need_verify = false;
            /* 方向验证暂时关闭——Vq脉冲方法在低带宽PI下响应太慢，
             * 500ms内无法产生可靠的净位移。需要更长的验证时间或
             * 不同的判断逻辑。暂时接受对齐本身的质量，
             * 必要时用 F 命令手动补偿。 */
        }
        /* VBUS/编码器异常时仅等待，不进故障 */
        break;

    /* ---- 运行中 ---- */
    case STATE_RUN:
    {
        /* 获取真实 ADC 原始快照，用于 IU/IV/IW 饱和检测 */
        uint16_t adc_raw[FOC_ADC_CH_COUNT];
        foc_interface_get_adc_raw(adc_raw);
        uint8_t f_now = check_faults(&meas, adc_raw);

        /* 去抖：同一种故障连续 FAULT_DEBOUNCE_CNT 帧才触发
         * 不同类型交替出现时重置计数器，防止误累加 */
        #define FAULT_DEBOUNCE_CNT  (500U)
        static uint16_t fault_consec = 0;
        static uint8_t  last_fault   = FAULT_NONE;
        if (f_now != FAULT_NONE) {
            if (f_now == last_fault) {
                fault_consec++;
            } else {
                /* 故障类型变化，重新开始计数 */
                last_fault   = f_now;
                fault_consec = 1;
            }
            if (fault_consec >= FAULT_DEBOUNCE_CNT) {
                s_fault = f_now;
                s_iq_ref_a = 0.0f;
                ctrl_sd_set(false);
                s_state = STATE_FAULT;
                fault_consec = 0;
                last_fault   = FAULT_NONE;
            }
        } else {
            fault_consec = 0;
            last_fault   = FAULT_NONE;
        }
        /* ---- 速度估算 + 位置环 + 速度 PI ---- */
        {
            float   theta_now = encoder_get_angle_rad();
            uint32_t now_ms   = HAL_GetTick();
            uint32_t dt_ms    = now_ms - s_est_prev_ms;

            if (dt_ms >= SPEED_EST_DT_MS) {
                float dt_s    = dt_ms * 1e-3f;
                float d_theta = theta_now - s_theta_prev_rad;
                /* 角度展开（防止 0→2π 跳变） */
                if (d_theta >  3.14159265f) d_theta -= TWO_PI;
                if (d_theta < -3.14159265f) d_theta += TWO_PI;

                float omega_raw = d_theta / dt_s;
                if (omega_raw >  30.0f) omega_raw =  30.0f;
                if (omega_raw < -30.0f) omega_raw = -30.0f;
                s_omega_est_rps = SPEED_EST_ALPHA * omega_raw
                                + (1.0f - SPEED_EST_ALPHA) * s_omega_est_rps;

                s_theta_prev_rad = theta_now;
                s_est_prev_ms    = now_ms;

                /* ---- D 项速度滤波（°/s，与 pos_actual 坐标一致）---- */
                float omega_dps = s_omega_est_rps * (180.0f / 3.14159265f);
                s_vel_filt_dps  = 0.85f * s_vel_filt_dps + 0.15f * omega_dps;
                float vel_pos   = MOTOR_SIGN * s_vel_filt_dps;

                /* ---- 位置环（CTRL_POSITION）----
                 * 直接 PD → IqRef，绕过速度 PI。
                 * 直接力矩测试 0.5A→~300dps，所以 IqRef = spd_cmd(°/s) / 300(°/s/A) */
                if (s_ctrl_mode == CTRL_POSITION) {
                    float pos_actual = get_pos_actual_deg();

                    if (fabsf(pos_actual) > 170.0f) {
                        s_iq_ref_a = 0.0f;
                        s_speed_integ = 0.0f;
                    } else {
                        float target      = s_pos_target_deg;
                        float pos_err     = target - pos_actual;

                        float spd_cmd;
                        if (fabsf(pos_err) < s_pos_deadband_deg) {
                            spd_cmd = 0.0f;
                        } else {
                            spd_cmd = s_kp_pos * pos_err - s_kd_pos * vel_pos;
                        }
                        float spd_lim_now = s_pos_spd_lim_dps;
                        if (fabsf(pos_actual) > POS_WARN_LIM_DEG) {
                            spd_lim_now = s_pos_spd_lim_dps * 0.3f;
                        }
                        if (pos_actual >  POS_HARD_LIM_DEG && spd_cmd > 0.0f) spd_cmd = 0.0f;
                        if (pos_actual < -POS_HARD_LIM_DEG && spd_cmd < 0.0f) spd_cmd = 0.0f;
                        if (spd_cmd >  spd_lim_now) spd_cmd =  spd_lim_now;
                        if (spd_cmd < -spd_lim_now) spd_cmd = -spd_lim_now;

                        /* 直接 PD 输出 → IqRef：300dps/A 换算 */
                        float iq_cmd = spd_cmd / 300.0f;
                        if (iq_cmd >  IQ_MAX_A) iq_cmd =  IQ_MAX_A;
                        if (iq_cmd < -IQ_MAX_A) iq_cmd = -IQ_MAX_A;
                        s_iq_ref_a = iq_cmd;
                    }
                    s_omega_ref_rps = 0.0f;  /* 不用速度PI */
                } else if (s_ctrl_mode == CTRL_STABILIZE) {
                    /* 自稳模式：目标角 = -IMU_SIGN × pitch
                     * 复用位置 PD 框架；pos_actual 在本分支各自取，不跨作用域 */
                    float pos_actual = get_pos_actual_deg();   /* ← 修复：本分支独立声明 */

