3142430257/chendian/STM32G431CBT6_Motor/STM32G431CBT6_motor/App/app_control.c
                    if (mpu6050_is_ready()) {
                        float tgt = -IMU_SIGN * (mpu6050_get_pitch_deg() - s_imu_home_offset_deg);
                        float lim = s_stab_lim_deg;
                        if (tgt >  lim) tgt =  lim;
                        if (tgt < -lim) tgt = -lim;
                        s_pos_target_deg = tgt;
                    }
                    /* IMU 未就绪时保持上一拍目标不变，位置环仍正常工作 */
                    {
                        float target      = s_pos_target_deg;
                        float spd_lim_now = s_pos_spd_lim_dps;
                        float pos_err     = target - pos_actual;
                        float spd_cmd;
                        if (fabsf(pos_err) < s_pos_deadband_deg) {
                            spd_cmd = 0.0f;
                        } else {
                            spd_cmd = s_kp_pos * pos_err - s_kd_pos * vel_pos;
                        }
                        if (pos_actual >  POS_HARD_LIM_DEG && spd_cmd > 0.0f) spd_cmd = 0.0f;
                        if (pos_actual < -POS_HARD_LIM_DEG && spd_cmd < 0.0f) spd_cmd = 0.0f;
                        if (spd_cmd >  spd_lim_now) spd_cmd =  spd_lim_now;
                        if (spd_cmd < -spd_lim_now) spd_cmd = -spd_lim_now;
                        s_omega_ref_rps = spd_cmd * (3.14159265f / 180.0f);
                    }
                }


                /* ---- 速度控制：前馈 + 比例（无积分，无 IIR 滤波）----
                 *
                 * 直接力矩测试标定：0.5A → ~300dps = 5.24 rad/s
                 * 前馈系数 K_FF = 0.5/5.24 ≈ 0.095 A/(rad/s)
                 *
                 * IqRef = K_FF * ω_ref + KP * (ω_ref - ω_raw)
                 *
                 * ω_raw 直接从编码器角度差计算，不经 IIR 滤波。
                 * 不用积分——前馈已提供大部分力矩，比例仅做微调。*/
                bool run_spd = (s_ctrl_mode == CTRL_STABILIZE)   ||
                               (s_ctrl_mode == CTRL_SPEED && s_speed_mode);
                if (run_spd) {
                    if (s_ctrl_mode == CTRL_SPEED) {
                        float delta = s_omega_ref_cmd - s_omega_ref_rps;
                        float step  = OMEGA_SLEW_RATE * dt_s;
                        if      (delta >  step) s_omega_ref_rps += step;
                        else if (delta < -step) s_omega_ref_rps -= step;
                        else                    s_omega_ref_rps  = s_omega_ref_cmd;
                    }

                    /* 瞬时速度 + 硬限幅防 EMI 毛刺 */
                    float omega_raw = d_theta / dt_s;
                    if (omega_raw >  10.0f) omega_raw =  10.0f;
                    if (omega_raw < -10.0f) omega_raw = -10.0f;

                    /* 前馈 + 比例 + 积分 */
                    float ff     = s_omega_ref_rps * 0.15f;
                    float err    = s_omega_ref_rps - omega_raw;
                    float iq_cmd = ff + 0.02f * err + s_speed_integ;

                    if (iq_cmd >  IQ_MAX_A) iq_cmd =  IQ_MAX_A;
                    if (iq_cmd < -IQ_MAX_A) iq_cmd = -IQ_MAX_A;

                    if (iq_cmd > -IQ_MAX_A && iq_cmd < IQ_MAX_A) {
                        s_speed_integ += 0.03f * err * dt_s;  /* 3x积分速度，加快收敛 */
                        if (s_speed_integ >  0.30f) s_speed_integ =  0.30f;
                        if (s_speed_integ < -0.30f) s_speed_integ = -0.30f;
                    }
                    s_iq_ref_a = iq_cmd;
                }
            }
        }
        break;
    }

    /* ---- 故障 ---- */
    case STATE_FAULT:
        ctrl_sd_set(false);
        /* 等待手动复位（app_control_disable + app_control_enable）*/
        break;

    default:
        break;
    }
}

/**
 * @brief  请求使能驱动板并进入 RUN 态
 * @return true  = 使能成功
 *         false = 前提条件不满足（VBUS/编码器异常），拒绝使能
 */
bool app_control_enable(void)
{
    if (s_state != STATE_READY) {
        return false;
    }

    /* --- 使能前提条件检查 ---
     * 前提不满足时保持 STATE_READY 返回 false，不进故障态。
     * 这不是系统故障，只是操作时机过早，调用方重试即可。*/
    FocMeasurement_t meas;
    foc_interface_get_measurement(&meas);

    if (meas.vbus_v < VBUS_MIN_V || meas.vbus_v > VBUS_MAX_V) {
        return false;   /* VBUS 未就绪，保持 READY */
    }
    if (!encoder_is_valid()) {
        return false;   /* 编码器未就绪，保持 READY */
    }

    /* 前提满足，使能 */
    s_fault = FAULT_NONE;
    /* 速度估算器基准重置：防止旧角度/旧时间产生一帧错误速度 */
    s_theta_prev_rad = encoder_get_angle_rad();
    s_est_prev_ms    = HAL_GetTick();
    s_omega_est_rps  = 0.0f;
    /* 位置环滤波器初始化 */
    s_vel_filt_dps   = 0.0f;
    ctrl_sd_set(true);
    s_state = STATE_RUN;
    return true;
}

void app_control_disable(void)
{
    s_iq_ref_a = 0.0f;
    /* 速度环清零 */
    s_speed_mode    = false;
    s_omega_ref_rps = 0.0f;
    s_omega_ref_cmd = 0.0f;
    s_speed_integ   = 0.0f;
    s_omega_est_rps = 0.0f;
    /* 速度估算基准重置 */
    s_theta_prev_rad = 0.0f;
    s_est_prev_ms    = 0;
    /* 位置环清零（保留 home_offset，方便重新使能后直接用 P0）*/
    s_ctrl_mode    = CTRL_SPEED;
    s_vel_filt_dps = 0.0f;
    ctrl_sd_set(false);
    if (s_state == STATE_FAULT) {
        s_fault = FAULT_NONE;
        s_state = STATE_READY;
    } else {
        s_state = STATE_READY;
    }
}

uint8_t app_control_get_state(void) { return (uint8_t)s_state; }
uint8_t app_control_get_fault(void) { return s_fault; }

/* ============================================================
 * Iq 指令接口（V3 Simulink 前置锁定）
 * ============================================================ */

/**
 * @brief  获取当前 q 轴目标电流 [A]
 * @note   仅 STATE_RUN 时返回有效值；其余状态强制返回 0.0f，
 *         防止状态机未就绪时 ISR 仍然输出非零指令。
 */
float app_control_get_iq_ref(void)
{
    if (s_state == STATE_RUN) {
        return s_iq_ref_a;
    }
    return 0.0f;
}

/**
 * @brief  设置 q 轴目标电流 [A]（速度环输出或外部调试指令）
 * @note   写操作在主循环；ISR 读 s_iq_ref_a 为 volatile float，
 *         Cortex-M4 单精度浮点写为原子操作，无需额外临界区。
 */
void app_control_set_iq_ref(float iq_ref_a)
{
    s_iq_ref_a = iq_ref_a;
}

/* ============================================================
 * ALIGN 接口（串口 'a' 命令触发，不自动上电执行）
 * ============================================================ */
#define ALIGN_HOLD_MS   (2000U)  /* 2s 对齐保持 */
#define ALIGN_ID_V      (3.0f)   /* d 轴对齐电压 [V]，Rs=2.7Ω → I≈1.1A，确保转子锁定 */
static uint32_t s_align_start_ms = 0;

bool app_control_start_align(void)
{
    if (s_state != STATE_READY) return false;
    /* 不再检 encoder_is_valid()，EMI 可能导致暂时失效 */

    s_align_start_ms = HAL_GetTick();
    s_state = STATE_ALIGN;      /* 先设状态，ISR 才能立即走 ALIGN 分支 */
    ctrl_sd_set(true);          /* 再使能驱动板（消除竞态窗口）*/
    return true;
}

static void align_update(const FocMeasurement_t *m)
{
    uint32_t now = HAL_GetTick();

