3142430257/chendian/STM32G431CBT6_Motor/STM32G431CBT6_motor/App/app_control.c
    /* 超时保护
     * ALIGN 仅持续 2s 且电流由固定电压限制（ALIGN_ID_V/Rs ≈ 1.1A），
     * 安全性由硬超时保证。
     * ⚠️ 不检 encoder_is_valid()：电机通电时 EMI 会让 PWM 捕获偶尔丢失，
     *    导致 ALIGN 提前退出 offset=0。编码器只需在最终读取时有效即可。 */
    bool overtime = ((now - s_align_start_ms) > (ALIGN_HOLD_MS + 500U));

    if (overtime) {
        ctrl_sd_set(false);
        s_state = STATE_READY;
        return;
    }

    if ((now - s_align_start_ms) >= ALIGN_HOLD_MS) {
        /* ── 记录编码器偏移 ── */
        ctrl_sd_set(false);
        HAL_Delay(3);

        float samples[8];
        for (int i = 0; i < 8; i++) {
            samples[i] = encoder_get_angle_rad() * (float)MOTOR_POLE_PAIRS;
            HAL_Delay(1);
        }
        for (int i = 0; i < 7; i++) {
            for (int j = i+1; j < 8; j++) {
                if (samples[i] > samples[j]) {
                    float tmp = samples[i];
                    samples[i] = samples[j];
                    samples[j] = tmp;
                }
            }
        }
        float raw_e = samples[3];
        while (raw_e >= 2.0f * 3.14159265f) raw_e -= 2.0f * 3.14159265f;
        while (raw_e <  0.0f)               raw_e += 2.0f * 3.14159265f;
        s_theta_offset_e = raw_e;
        while (s_theta_offset_e >= 2.0f * 3.14159265f) s_theta_offset_e -= 2.0f * 3.14159265f;
        while (s_theta_offset_e <  0.0f)               s_theta_offset_e += 2.0f * 3.14159265f;

        /* 对齐完成，进入 READY。方向验证在 app_control_update() 的
         * STATE_READY 中进行（需要 ISR 正常闭环才能注入 IqRef）。*/
        s_state = STATE_READY;
        s_align_need_verify = true;   /* 标记：下次 update 时做方向验证 */
    }
}

float app_control_get_align_id_ref(void)
{
    return (s_state == STATE_ALIGN) ? ALIGN_ID_V : 0.0f;
}

float app_control_get_theta_offset(void)
{
    return s_theta_offset_e;
}

void app_control_set_fine_offset(float rad)
{
    s_theta_fine_rad = rad;
}

float app_control_get_fine_offset(void)
{
    return s_theta_fine_rad;
}

/* ============================================================
 * 速度环公共接口
 * ============================================================ */

void app_control_set_speed_mode(bool enable)
{
    if (enable && !s_speed_mode) {
        /* 进入速度模式：清积分+基准重置+斜坡从当前速度开始 */
        s_speed_mode     = true;
        s_speed_integ    = 0.0f;
        s_theta_prev_rad = encoder_get_angle_rad();
        s_est_prev_ms    = HAL_GetTick();
        s_omega_ref_rps  = s_omega_est_rps;
        s_omega_ref_cmd  = s_omega_ref_rps;
        /* 进入速度模式时退出位置模式 */
        if (s_ctrl_mode != CTRL_SPEED) {
            s_ctrl_mode    = CTRL_SPEED;
            s_vel_filt_dps = 0.0f;
        }
    } else if (!enable && s_speed_mode) {
        s_speed_mode = false;
    }
}

void app_control_set_omega_ref(float omega_rad_s)
{
    s_omega_ref_cmd = omega_rad_s;
}

float app_control_get_omega_est(void)  { return s_omega_est_rps; }
float app_control_get_omega_ref(void)  { return s_omega_ref_rps; }

bool app_control_get_speed_mode(void)
{
    return s_speed_mode;
}

/* ============================================================
 * 位置控制公共接口
 * ============================================================ */

void app_control_set_ctrl_mode(CtrlMode_t mode)
{
    if (mode == s_ctrl_mode) return;
    /* 切换模式时清位置环状态 */
    s_speed_integ  = 0.0f;
    s_vel_filt_dps = 0.0f;
    s_ctrl_mode    = mode;
    if (mode == CTRL_SPEED) {
        /* 切回速度模式：斜坡基准从当前速度开始，防止阶跃 */
        s_omega_ref_rps = s_omega_est_rps;
        s_omega_ref_cmd = s_omega_est_rps;
    } else {
        /* 进入位置/自稳模式：必须清 s_speed_mode。
         * 否则 set_speed_mode(true) 看到 mode==true 会跳过重置逻辑，
         * 导致和 S<dps>/]命令切不回速度模式。 */
        s_speed_mode = false;
    }
}

CtrlMode_t app_control_get_ctrl_mode(void) { return s_ctrl_mode; }

void app_control_set_pos_target(float deg)
{
    /* 限制到软限位范围 */
    if (deg >  POS_SOFT_LIM_DEG) deg =  POS_SOFT_LIM_DEG;
    if (deg < -POS_SOFT_LIM_DEG) deg = -POS_SOFT_LIM_DEG;
    s_pos_target_deg = deg;
}

void app_control_home(void)
{
    /* 以当前编码器角为 0° 基准，必须在载荷水平时执行！ */
    s_pos_home_offset_deg = encoder_get_angle_rad() * (180.0f / 3.14159265f);
    s_pos_target_deg      = 0.0f;
    /* 同步记录 IMU 安装偏置：如果 MPU6050 静止读数不是 0°，这里吸收该偏置 */
    s_imu_home_offset_deg = mpu6050_get_pitch_deg();
    app_control_set_ctrl_mode(CTRL_POSITION);
}

float app_control_get_pos_actual_deg(void) { return get_pos_actual_deg(); }
float app_control_get_pos_target_deg(void) { return s_pos_target_deg; }

void app_control_set_kp_pos(float kp)
{
    if (kp < 0.0f)  kp = 0.0f;
    if (kp > 20.0f) kp = 20.0f;
    s_kp_pos = kp;
}
void app_control_set_kd_pos(float kd)
{
    if (kd < 0.0f) kd = 0.0f;
    if (kd > 2.0f) kd = 2.0f;
    s_kd_pos = kd;
}
void app_control_set_pos_spd_lim(float spd)
{
    if (spd <  10.0f) spd =  10.0f;   /* 最小 10°/s */
    if (spd > 300.0f) spd = 300.0f;   /* 最大 300°/s */
    s_pos_spd_lim_dps = spd;
}
void app_control_set_pos_deadband(float dz)
{
    if (dz < 0.0f) dz = 0.0f;
    if (dz > 5.0f) dz = 5.0f;
    s_pos_deadband_deg = dz;
}

/* 调参参数读取接口（主循环回显实际生效值） */
float app_control_get_kp_pos(void)       { return s_kp_pos; }
float app_control_get_kd_pos(void)       { return s_kd_pos; }
float app_control_get_pos_spd_lim(void)  { return s_pos_spd_lim_dps; }
float app_control_get_pos_deadband(void) { return s_pos_deadband_deg; }

void app_control_set_stab_lim(float deg)
{
    if (deg < 2.0f)  deg = 2.0f;
    if (deg > 90.0f) deg = 90.0f;
    s_stab_lim_deg = deg;
}
float app_control_get_stab_lim(void)  { return s_stab_lim_deg; }
float app_control_get_imu_home(void)  { return s_imu_home_offset_deg; }
